templates/shipment-create.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <AuthHeader xmlns="https://www.xend.com.ph/api/">
      <UserToken>A80FF2CB-9523-4184-9C0C-F38707353241</UserToken>
    </AuthHeader>
  </soap:Header>
  <soap:Body>
    <Create xmlns="https://www.xend.com.ph/api/">
      <shipment>
        <ServiceTypeValue>{{ type }}</ServiceTypeValue>
        <ShipmentTypeValue>Parcel</ShipmentTypeValue>
        <PurposeOfExportValue>Other</PurposeOfExportValue>
        <CountryManufactured>Philippines</CountryManufactured>
        <Weight>{{ weight }}</Weight>
        <DimensionL>{{ length }}</DimensionL>
        <DimensionW>{{ width }}</DimensionW>
        <DimensionH>{{ height }}</DimensionH>
        <DeclaredValue>{{ params[:value] || 0 }}</DeclaredValue>
        <RecipientName>{{ name }}</RecipientName>
        <RecipientCompanyName>None</RecipientCompanyName>
        <RecipientAddress1>{{ address1 }}</RecipientAddress1>
        <RecipientAddress2>{{ params[:address2] }}</RecipientAddress2>
        <RecipientCity>{{ city }}</RecipientCity>
        <RecipientProvince>{{ province }}</RecipientProvince>
        <RecipientPostalCode>{{ zip }}</RecipientPostalCode>
        <RecipientCountry>Philippines</RecipientCountry>
        <IsInsured>{{ params[:value] ? true : false }}</IsInsured>
      </shipment>
    </Create>
  </soap:Body>
</soap:Envelope>